fio/results/vm.log
sequential-fill: (g=0): rw=write, bs=1M-1M/1M-1M, ioengine=libaio, iodepth=16
seq-read-1: (g=1): rw=read, bs=1M-1M/1M-1M, ioengine=libaio, iodepth=1
seq-read-2: (g=2): rw=read, bs=1M-1M/1M-1M, ioengine=libaio, iodepth=2
random-write-16: (g=3): rw=randwrite, bs=4K-4K/4K-4K, ioengine=libaio, iodepth=16
random-write-16x8: (g=4): rw=randwrite, bs=4K-4K/4K-4K, ioengine=libaio, iodepth=16
...
random-write-16x8: (g=4): rw=randwrite, bs=4K-4K/4K-4K, ioengine=libaio, iodepth=16
random-read-16: (g=5): rw=randread, bs=4K-4K/4K-4K, ioengine=libaio, iodepth=16
random-read-16x8: (g=6): rw=randread, bs=4K-4K/4K-4K, ioengine=libaio, iodepth=16
...
random-read-16x8: (g=6): rw=randread, bs=4K-4K/4K-4K, ioengine=libaio, iodepth=16
mixed-random-rw-32x8: (g=7): rw=randrw, bs=4K-4K/4K-4K, ioengine=libaio, iodepth=32
...
mixed-random-rw-32x8: (g=7): rw=randrw, bs=4K-4K/4K-4K, ioengine=libaio, iodepth=32
2.0.8
Starting 29 threads
sequential-fill: Laying out IO file(s) (1 file(s) / 16384MB)

sequential-fill: (groupid=0, jobs=1): err= 0: pid=1951
  Description  : [Sequential fill phase]
  write: io=16384MB, bw=737655KB/s, iops=720 , runt= 22744msec
    slat (usec): min=60 , max=21886 , avg=177.08, stdev=290.22
    clat (msec): min=2 , max=337 , avg=22.02, stdev= 9.99
     lat (msec): min=2 , max=337 , avg=22.20, stdev= 9.99
    clat percentiles (msec):
     |  1.00th=[    6],  5.00th=[   18], 10.00th=[   23], 20.00th=[   23],
     | 30.00th=[   23], 40.00th=[   23], 50.00th=[   23], 60.00th=[   23],
     | 70.00th=[   23], 80.00th=[   23], 90.00th=[   23], 95.00th=[   23],
     | 99.00th=[   24], 99.50th=[   27], 99.90th=[   44], 99.95th=[  326],
     | 99.99th=[  334]
    bw (KB/s)  : min=352052, max=757760, per=100.00%, avg=740243.71, stdev=60383.05
    lat (msec) : 4=0.66%, 10=1.91%, 20=3.25%, 50=94.08%, 500=0.10%
  cpu          : usr=4.10%, sys=10.44%, ctx=16388, majf=0, minf=96
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=99.9%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=16384/d=0, short=r=0/w=0/d=0
seq-read-1: (groupid=1, jobs=1): err= 0: pid=1952
  read : io=16384MB, bw=437876KB/s, iops=427 , runt= 38315msec
    slat (usec): min=67 , max=927 , avg=133.10, stdev=14.23
    clat (msec): min=1 , max=156 , avg= 2.20, stdev= 1.21
     lat (msec): min=1 , max=156 , avg= 2.33, stdev= 1.21
    clat percentiles (usec):
     |  1.00th=[ 2064],  5.00th=[ 2096], 10.00th=[ 2096], 20.00th=[ 2128],
     | 30.00th=[ 2160], 40.00th=[ 2160], 50.00th=[ 2160], 60.00th=[ 2192],
     | 70.00th=[ 2192], 80.00th=[ 2224], 90.00th=[ 2256], 95.00th=[ 2320],
     | 99.00th=[ 2416], 99.50th=[ 3088], 99.90th=[ 3952], 99.95th=[ 4128],
     | 99.99th=[ 4896]
    bw (KB/s)  : min=304761, max=453748, per=100.00%, avg=438229.76, stdev=17157.46
    lat (msec) : 2=0.12%, 4=99.80%, 10=0.08%, 250=0.01%
  cpu          : usr=1.04%, sys=7.00%, ctx=17156, majf=0, minf=409
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=16384/w=0/d=0, short=r=0/w=0/d=0
seq-read-2: (groupid=2, jobs=1): err= 0: pid=1953
  read : io=16384MB, bw=801319KB/s, iops=782 , runt= 20937msec
    slat (usec): min=102 , max=1034 , avg=117.06, stdev=14.43
    clat (usec): min=1742 , max=17177 , avg=2433.04, stdev=219.12
     lat (usec): min=1871 , max=17281 , avg=2550.98, stdev=218.98
    clat percentiles (usec):
     |  1.00th=[ 2256],  5.00th=[ 2352], 10.00th=[ 2384], 20.00th=[ 2384],
     | 30.00th=[ 2416], 40.00th=[ 2416], 50.00th=[ 2416], 60.00th=[ 2416],
     | 70.00th=[ 2448], 80.00th=[ 2448], 90.00th=[ 2480], 95.00th=[ 2480],
     | 99.00th=[ 2832], 99.50th=[ 3568], 99.90th=[ 4832], 99.95th=[ 5088],
     | 99.99th=[15680]
    bw (KB/s)  : min=780288, max=806912, per=100.00%, avg=801946.73, stdev=4019.81
    lat (msec) : 2=0.12%, 4=99.55%, 10=0.32%, 20=0.01%
  cpu          : usr=1.11%, sys=11.50%, ctx=16808, majf=0, minf=596
  IO depths    : 1=0.1%, 2=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=16384/w=0/d=0, short=r=0/w=0/d=0
random-write-16: (groupid=3, jobs=1): err= 0: pid=1954
  Description  : [Random write steady state phase]
  write: io=4672.9MB, bw=79749KB/s, iops=19937 , runt= 60001msec
    slat (usec): min=3 , max=1768 , avg=10.76, stdev= 6.68
    clat (usec): min=222 , max=181783 , avg=788.97, stdev=868.19
     lat (usec): min=229 , max=181791 , avg=800.18, stdev=868.42
    clat percentiles (usec):
     |  1.00th=[  490],  5.00th=[  652], 10.00th=[  684], 20.00th=[  716],
     | 30.00th=[  732], 40.00th=[  756], 50.00th=[  780], 60.00th=[  796],
     | 70.00th=[  812], 80.00th=[  844], 90.00th=[  900], 95.00th=[  956],
     | 99.00th=[ 1048], 99.50th=[ 1144], 99.90th=[ 1944], 99.95th=[ 2040],
     | 99.99th=[ 2896]
    bw (KB/s)  : min=51976, max=112304, per=100.00%, avg=79814.39, stdev=5365.07
    lat (usec) : 250=0.01%, 500=1.14%, 750=36.01%, 1000=60.08%
    lat (msec) : 2=2.70%, 4=0.06%, 10=0.01%, 20=0.01%, 250=0.01%
  cpu          : usr=10.18%, sys=26.20%, ctx=80545, majf=0, minf=239
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=1196255/d=0, short=r=0/w=0/d=0
random-write-16x8: (groupid=4, jobs=8): err= 0: pid=1955
  Description  : [Random write steady state phase]
  write: io=13904MB, bw=237287KB/s, iops=59321 , runt= 60002msec
    slat (usec): min=3 , max=61451 , avg=17.76, stdev=83.87
    clat (usec): min=220 , max=264278 , avg=2138.16, stdev=1677.07
     lat (usec): min=279 , max=264292 , avg=2156.20, stdev=1679.31
    clat percentiles (usec):
     |  1.00th=[  700],  5.00th=[ 1112], 10.00th=[ 1688], 20.00th=[ 1848],
     | 30.00th=[ 1944], 40.00th=[ 2024], 50.00th=[ 2096], 60.00th=[ 2192],
     | 70.00th=[ 2320], 80.00th=[ 2448], 90.00th=[ 2704], 95.00th=[ 2928],
     | 99.00th=[ 3536], 99.50th=[ 3760], 99.90th=[ 4448], 99.95th=[ 4832],
     | 99.99th=[16768]
    bw (KB/s)  : min=18809, max=34986, per=12.52%, avg=29699.91, stdev=2888.40
    lat (usec) : 250=0.01%, 500=0.04%, 750=1.44%, 1000=2.70%
    lat (msec) : 2=33.68%, 4=61.87%, 10=0.25%, 20=0.01%, 50=0.01%
    lat (msec) : 100=0.01%, 500=0.01%
  cpu          : usr=15.52%, sys=76.14%, ctx=3201159, majf=0, minf=2519
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=3559430/d=0, short=r=0/w=0/d=0
random-read-16: (groupid=5, jobs=1): err= 0: pid=1963
  Description  : [Random read steady state phase]
  read : io=5883.5MB, bw=100409KB/s, iops=25102 , runt= 60001msec
    slat (usec): min=2 , max=122 , avg= 9.78, stdev= 4.63
    clat (usec): min=237 , max=151753 , avg=624.96, stdev=507.10
     lat (usec): min=243 , max=151778 , avg=635.19, stdev=507.46
    clat percentiles (usec):
     |  1.00th=[  386],  5.00th=[  438], 10.00th=[  470], 20.00th=[  516],
     | 30.00th=[  556], 40.00th=[  588], 50.00th=[  612], 60.00th=[  652],
     | 70.00th=[  692], 80.00th=[  732], 90.00th=[  788], 95.00th=[  820],
     | 99.00th=[  884], 99.50th=[  924], 99.90th=[ 1176], 99.95th=[ 1272],
     | 99.99th=[ 2040]
    bw (KB/s)  : min=80032, max=153536, per=100.00%, avg=100437.85, stdev=5405.62
    lat (usec) : 250=0.01%, 500=15.95%, 750=67.91%, 1000=15.83%
    lat (msec) : 2=0.29%, 4=0.01%, 250=0.01%
  cpu          : usr=11.22%, sys=30.02%, ctx=95830, majf=0, minf=239
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=1506163/w=0/d=0, short=r=0/w=0/d=0
random-read-16x8: (groupid=6, jobs=8): err= 0: pid=1964
  Description  : [Random read steady state phase]
  read : io=10822MB, bw=184696KB/s, iops=46173 , runt= 60002msec
    slat (usec): min=2 , max=12076 , avg=20.23, stdev=54.34
    clat (usec): min=74 , max=160207 , avg=2749.99, stdev=1356.25
     lat (usec): min=388 , max=160227 , avg=2770.53, stdev=1361.72
    clat percentiles (usec):
     |  1.00th=[ 1624],  5.00th=[ 1800], 10.00th=[ 1912], 20.00th=[ 2064],
     | 30.00th=[ 2192], 40.00th=[ 2320], 50.00th=[ 2448], 60.00th=[ 2640],
     | 70.00th=[ 2960], 80.00th=[ 3600], 90.00th=[ 4128], 95.00th=[ 4384],
     | 99.00th=[ 4768], 99.50th=[ 4896], 99.90th=[ 5216], 99.95th=[ 5728],
     | 99.99th=[14272]
    bw (KB/s)  : min=15248, max=32368, per=12.50%, avg=23079.03, stdev=5845.35
    lat (usec) : 100=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=15.06%, 4=72.77%, 10=12.15%, 20=0.01%, 50=0.01%
    lat (msec) : 250=0.01%
  cpu          : usr=12.14%, sys=78.09%, ctx=2040449, majf=0, minf=1943
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=2770525/w=0/d=0, short=r=0/w=0/d=0
mixed-random-rw-32x8: (groupid=7, jobs=8): err= 0: pid=1972
  read : io=8322.2MB, bw=142032KB/s, iops=35507 , runt= 60006msec
    slat (usec): min=2 , max=205409 , avg=111.83, stdev=670.31
    clat (usec): min=312 , max=215985 , avg=5146.97, stdev=3404.34
     lat (usec): min=322 , max=215992 , avg=5259.14, stdev=3493.05
    clat percentiles (usec):
     |  1.00th=[ 1672],  5.00th=[ 1976], 10.00th=[ 2128], 20.00th=[ 2352],
     | 30.00th=[ 2736], 40.00th=[ 4256], 50.00th=[ 4704], 60.00th=[ 5216],
     | 70.00th=[ 6432], 80.00th=[ 7008], 90.00th=[ 9152], 95.00th=[10560],
     | 99.00th=[14272], 99.50th=[15680], 99.90th=[19072], 99.95th=[20864],
     | 99.99th=[29056]
    bw (KB/s)  : min= 9047, max=23313, per=12.52%, avg=17784.45, stdev=2350.33
  write: io=3570.7MB, bw=60923KB/s, iops=15230 , runt= 60006msec
    slat (usec): min=2 , max=201096 , avg=111.72, stdev=658.31
    clat (usec): min=323 , max=215213 , avg=4428.07, stdev=3058.56
     lat (usec): min=335 , max=215229 , avg=4540.15, stdev=3140.71
    clat percentiles (usec):
     |  1.00th=[ 1640],  5.00th=[ 1928], 10.00th=[ 2064], 20.00th=[ 2224],
     | 30.00th=[ 2448], 40.00th=[ 2896], 50.00th=[ 4384], 60.00th=[ 4704],
     | 70.00th=[ 5216], 80.00th=[ 6368], 90.00th=[ 7136], 95.00th=[ 9024],
     | 99.00th=[11968], 99.50th=[13504], 99.90th=[17024], 99.95th=[18560],
     | 99.99th=[29056]
    bw (KB/s)  : min= 3611, max=10040, per=12.52%, avg=7628.17, stdev=1027.35
    lat (usec) : 500=0.01%, 750=0.07%, 1000=0.11%
    lat (msec) : 2=5.89%, 4=34.76%, 10=54.56%, 20=4.54%, 50=0.06%
    lat (msec) : 250=0.01%
  cpu          : usr=15.06%, sys=67.60%, ctx=2299500, majf=0, minf=2400
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=2130687/w=913936/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
  WRITE: io=16384MB, aggrb=737654KB/s, minb=737654KB/s, maxb=737654KB/s, mint=22744msec, maxt=22744msec

Run status group 1 (all jobs):
   READ: io=16384MB, aggrb=437875KB/s, minb=437875KB/s, maxb=437875KB/s, mint=38315msec, maxt=38315msec

Run status group 2 (all jobs):
   READ: io=16384MB, aggrb=801319KB/s, minb=801319KB/s, maxb=801319KB/s, mint=20937msec, maxt=20937msec

Run status group 3 (all jobs):
  WRITE: io=4672.9MB, aggrb=79749KB/s, minb=79749KB/s, maxb=79749KB/s, mint=60001msec, maxt=60001msec

Run status group 4 (all jobs):
  WRITE: io=13904MB, aggrb=237287KB/s, minb=237287KB/s, maxb=237287KB/s, mint=60002msec, maxt=60002msec

Run status group 5 (all jobs):
   READ: io=5883.5MB, aggrb=100409KB/s, minb=100409KB/s, maxb=100409KB/s, mint=60001msec, maxt=60001msec

Run status group 6 (all jobs):
   READ: io=10822MB, aggrb=184695KB/s, minb=184695KB/s, maxb=184695KB/s, mint=60002msec, maxt=60002msec

Run status group 7 (all jobs):
   READ: io=8322.2MB, aggrb=142031KB/s, minb=142031KB/s, maxb=142031KB/s, mint=60006msec, maxt=60006msec
  WRITE: io=3570.7MB, aggrb=60922KB/s, minb=60922KB/s, maxb=60922KB/s, mint=60006msec, maxt=60006msec

Disk stats (read/write):
  vda: ios=6502638/5721484, merge=1/554, ticks=11965736/10156120, in_queue=22118240, util=96.93%